In [11]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("tempno.db")

missions_df = pd.read_sql("SELECT * FROM missions", conn)
dossiers_df = pd.read_sql("SELECT * FROM dossiers", conn)
clients_df = pd.read_sql("SELECT * FROM clients", conn)

In [12]:
missions_df

   id matricule_mission        nom_mission  id_dossier
0   1             M5001    Tenue mensuelle           1
1   2             M5002   Déclarations TVA           1
2   3             M6001  Bulletins de paie           2
3   4             M7001       Audit annuel           3

In [13]:
dossiers_df

   id matricule_dossier   nom_dossier  id_client  id_associe
0   1             D1001  Compta Alpha          1           1
1   2             D1002    Paie Alpha          1           1
2   3             D2001    Audit Beta          2           2

In [14]:
clients_df

   id        nom_client  id_associe
0   1  Entreprise Alpha           1
1   2   Entreprise Beta           2

In [15]:
df = missions_df.merge(dossiers_df, left_on="id_dossier",
                                right_on="id", suffixes=("", "_dossier")
                               )

In [16]:
df

,id,matricule_mission,nom_mission,id_dossier,id_dossier,matricule_dossier,nom_dossier,id_client,id_associe
0,1,M5001,Tenue mensuelle,1,1,D1001,Compta Alpha,1,1
1,2,M5002,Déclarations TVA,1,1,D1001,Compta Alpha,1,1
2,3,M6001,Bulletins de paie,2,2,D1002,Paie Alpha,1,1
3,4,M7001,Audit annuel,3,3,D2001,Audit Beta,2,2

In [17]:
df = df.merge(clients_df, left_on="id_client",
                                right_on="id", suffixes=("", "_client")
                               )

In [18]:
df

,id,matricule_mission,nom_mission,id_dossier,id_dossier,matricule_dossier,nom_dossier,id_client,id_associe,id_client,nom_client,id_associe_client
0,1,M5001,Tenue mensuelle,1,1,D1001,Compta Alpha,1,1,1,Entreprise Alpha,1
1,2,M5002,Déclarations TVA,1,1,D1001,Compta Alpha,1,1,1,Entreprise Alpha,1
2,3,M6001,Bulletins de paie,2,2,D1002,Paie Alpha,1,1,1,Entreprise Alpha,1
3,4,M7001,Audit annuel,3,3,D2001,Audit Beta,2,2,2,Entreprise Beta,2